[{"Srno":0,"Product_Name":"truke BTG1 Gaming earbuds with 60ms Low Latency | 13mm ...","Price":799,"Description":"With Mic:YesBluetooth version: 5.1Wireless range: 10 mBattery life: 48 hrs | Charging time: 1.5 hrs","Url":"https:\/\/www.flipkart.com\/truke-btg1-gaming-earbuds-60ms-low-latency-13mm-drivers-aac-codec-bluetooth-headset\/p\/itm5bca4567be1ed?pid=ACCG5BDHUHJCZ4CG&lid=LSTACCG5BDHUHJCZ4CGYZPEN9&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_1&otracker=search&iid=en_7j8iHdF3eEer7z3t%2Fy1Ck4tC%2BTXWda76mTGxecr9HDfRoTTucA32hWleEWLtliN1hXeEyvY7IP72%2FrlK6n1LUQ%3D%3D&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/ksnjp8w0\/headphone\/t\/o\/k\/btg-1-truke-original-imag66cyarerhhgr.jpeg?q=70","Ratings":3.9,"Reviews":["Here are the best gaming earphones presented to you by truke.Reasons why i call it best :-1. Very high definition Sound.2. The lighting effects makes it look premium.3. There are 4 mic in the buds for clear calling.4. Easy and multipurpose controls.5. A big battery backup and fast charging.6. Gaming Mode is awesome.7. Google assistant and Siri can be used.8. Premium and compact case with unique battery indicator.9. Very affordable Price and highly recommended.10. Fast delivery by F...READ MORE","The game mode really works perfectly and it's highly recommended for bass lovers, the music or the normal mode is also amazing! Best part of this buds green light and touch ratio is amazing.READ MORE","Here are the best gaming earphones presented to you by truke.Reasons why i call it best :-1. Very high definition Sound.2. The lighting effects makes it look premium.3. There are 4 mic in the buds for clear calling.4. Easy and multipurpose controls.5. A big battery backup and fast charging.6. Gaming Mode is awesome.7. Google assistant and Siri can be used.8. Premium and compact case with unique battery indicator.9. Very affordable Price and highly recommended.10. Fast delivery by F...READ MORE","Wow! It has a unique design which is best. The game mode really works perfectly and it's highly recommended for bass lovers, the music or the normal mode is also amazing loved it. Best battery life, sound quality, design & built so just go for itREAD MORE","Writing this review after, one month usage. I am an avid earphone user and till now most of the products that I had used were wired ones and mostly over the ear ones. I wanted a hassle free experience where, I could attend calls, play games and hear music without having a plethora of wires infront of me. Firstly, this review addresses the pros and the cons, will be addressed in the second part.PROS:* LATENCY - The first point to consider is the Latency itself. While using the normal\/music ...READ MORE","Currently I am using truke buds 1 from almost 6 months and my sister was asking for me to buy a similar kind of buds for her too. So I bought this latest buds as a rakshabandhan gift, she liked the overall quality of the earbuds and liked the design.I fell happy that I gifted a best one for this year rakshabandhan, hoping it will last for more than a couple of years.READ MORE","Its one of the best bluetooth earbuds amazing balanced sound quality with good bass. Stylish and compact for daily use. Light weight and very comfortable for long hours. Touch control works smoothly. Highest battery life totally satisfied.READ MORE","Best product in low budget best sound quality best mic, best gaming experiencen. Best earbuds to thank you for the good experienceREAD MORE","BTG1 EARBUDS HAVE UNIQUE & ATTRACTIVE DESIGNIT 13 MM DRIVER UNITS GIVE SMOOTH & PERFECT SOUNDTHIS IS QUALITY EARBUD WITH DEEPBASS.AlsO PERFECTLY SUITABLE TO GAME.ALSO CHARGING BACKUP IS ALDO GOOD.FULLY SATISFIED WITH THIS BTG1 EARBUDS.READ MORE","Best in class sound quality is fabulous has good bass and noise isolation. The touch is perfect, good fit to ears won't fall while running or working out. These are light weight and super comfortable. Best design overall a great product in this price range.READ MORE"],"Store":"f"},{"Srno":1,"Product_Name":"Redgear Cloak Wired Gaming Headset","Price":549,"Description":"With Mic:YesConnector type: 3.5Driver: 50mmWiredOver Ear HeadphonesMic: YesOmni Directional MicBuild Quality: Comfortable and DurableRGB LightingScroll for Volume Control","Url":"https:\/\/www.flipkart.com\/redgear-cloak-wired-gaming-headset\/p\/itm1630daaac0176?pid=ACCG2DGWYRHBWVZW&lid=LSTACCG2DGWYRHBWVZW0A6CNU&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_2&otracker=search&iid=en_7j8iHdF3eEer7z3t%2Fy1Ck4tC%2BTXWda76mTGxecr9HDf2r6T16mfH8K8evtp%2BSkhdqgohk9cTjcxDg26SdJJl9g%3D%3D&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l30hmkw0\/headphone\/3\/i\/l\/-original-image8f8twewzdzb.jpeg?q=70","Ratings":4.1,"Reviews":["These are real good headphones for teenagers and adults, I don't recommend these for children because of its big ear-cups and it's weight. This Headset has a real good bass and very good mic. I recommend this for you only if you have 1 Headphone Jack, 1Mic Jack and 1 USB Jack in your PC\/Laptop. If you don't have then buy a connector and try. Overall this is a very good headset and I loved it.READ MORE","Valuable product It sound quality is very good..It is best for online class and gaming.I have played minecraft nd every mob and lava sound is very much clear. ..It is good for listening music also in Spotify..READ MORE","If you looking comfort for long hours gaming it's not for you because after using 1 hours your ear will start pain. After this good for look, bas isn't good but it will be value for money ?READ MORE","Excellent Thank You Flipkart 🤝🏻 really looking Good Thank You Flipkart 🤝🏻 Vellai From Chennai 🙏🏻READ MORE","Best headphone ever seen but it needs some sound improvement it's perfect for gamers and youtubers perfect MicREAD MORE","Not that much good as i have predicted but it's enough for a decent gaming and a decent performance It's performance is much better in laptop or pc than in a phone because the headphones are louder in a laptop or pc than a phone and your game will also lag if you use there headphones to play games in phones because the phone is not capable to give enough power supply to headphoneREAD MORE","Good product,sound quality is better, bulid quality good  wire lenth 2 meter Wire bulid quality  is best,But No base in this headphone RGB good work in this headphones overall  good headphones  for this range Thanks for flipkart.....READ MORE","value for money very good quality and bass OMG realy osmREAD MORE","Awesome productsREAD MORE","Probably the best pc oriented gaming headphones in this price range, I just loved itREAD MORE"],"Store":"f"},{"Srno":2,"Product_Name":"Cosmic Byte GS430 Wired Headset","Price":449,"Description":"With Mic:YesConnector type: 3.5 mm","Url":"https:\/\/www.flipkart.com\/cosmic-byte-gs430-wired-headset\/p\/itm097793e7dfbb2?pid=ACCFPRKY5UMKFVNH&lid=LSTACCFPRKY5UMKFVNHRES07B&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&spotlightTagId=BestvalueId_0pm%2Ffcn&srno=s_1_3&otracker=search&fm=organic&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCFPRKY5UMKFVNH.SEARCH&ppt=sp&ppn=sp&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/k7ksvww0\/headphone\/v\/n\/h\/cosmic-byte-gs430-original-imafprpfzyx2tzru.jpeg?q=70","Ratings":4.2,"Reviews":["Sound quality is decent . Game sound quality is too good .  Best for gaming Headphone . Music sound quality is decent and bass is good .READ MORE","I have been using this for over 2 weeks and this is my review.  Very nice sound, but it sounds like there is less sound at the sides. The quality and RGB are very nice too but if you have it on for more than 1 hour then it is very hot so I recommend to use it in a AC room. The wire fabric is good enough and thick and very durable and lightweight. The Mic lock tight enough to not come loose, the Mic quality is Ok because it picks up a lot of background noises. The upper cushion is ve...READ MORE","They just work and give you good sound but when it comes to connections then this lacks alot. Like you need to buy one external male to female separator, if you are using them on latop then they work good. The comfort is so,so. I can only wear it for 1 hour. And if you don't have an AC in your room then you can't even wear them for 10 minutes. In short keep yourself cold before wearing them.READ MORE","this is a very good headphone in this prize.... sound quality is very good and bass are very good ane when I play game I fell very good quality sound..... go for itREAD MORE","This think is op for pc user But for mobile user there is a problemThe light does not work it works only for pc but the sound collety is goodREAD MORE","5\/5 - I am using this headphones from 1 Week I realizedㅤㅤㅤ     this is very good at this price for steamers or gamers..5\/5 - if you using this headphones in airy room then           od4\/5 - Not an Echo free but value for money!ㅤㅤ  Packaging is Too Good!Suggest - I Suggest you to buy this product 😊READ MORE","Best headphones for gaming and even for music .must buy it is a really amazing and it is  very softREAD MORE","Under my budget section this one is the best. Even tho flipkart delivered it like after 20 days but worth the wait. Going for my first competitive match in Valorant. Played unrated just pretty amazing. Overall 8\/10 :)READ MORE","Awesome product just go for it sound quality is awesome for gaming and bass ok ok just amazing I am writing this review after 3 day of use best in this segmentREAD MORE","What's wrong with people, this is not a 4 star product at all!Their are more cons than pros.1) The sound is so crispy that it could make you deaf if a higher pitch sound is played.2)You cannot wear it for a long time because the cushions are not soft at all! And moreover you gonna sweat like a lot if you are at room temperature.3) The mic is just useless. Utterly disappointed with the quality of the mic. It is omni directional mic but works like an ambient one because its impedance is ver...READ MORE"],"Store":"f"},{"Srno":3,"Product_Name":"Cosmic Byte G4000 Wired Gaming Headset","Price":449,"Description":"With Mic:YesConnector type: 3.5 mmPrimary kind of gaming headset, perfect for playing games, listening music, etc.Flexible microphone for exact positioning and mic with great sensitivity at picking up sounds, your partner can hear your words clearlyLittle smart in-line Remote Control for sound and Mic, LED light are designed on the ear cups, make it look more fashionable and stunningSoft cushion head-pad and ear-pad, as well as adjustable length hinges guarantee hours of gaming comfort","Url":"https:\/\/www.flipkart.com\/cosmic-byte-g4000-wired-gaming-headset\/p\/itm2b056bc4b401f?pid=ACCEKM3UKHZJNM3B&lid=LSTACCEKM3UKHZJNM3BK0AF0U&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_4&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCEKM3UKHZJNM3B.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/j5mrxjk0\/headphone\/m\/3\/b\/kotion-each-g4000-original-imaewa4v9uqbtxd7.jpeg?q=70","Ratings":4.2,"Reviews":["well the headphone is pretty good; the built and design is very good and comfortable. Every day i use it 6 7 hours and i  feel no pain on my ear which mostly happens with any other headphone cause its circumference is much big and covers my whole ear. In terms of sounds it is not that good(not too loud) but better than earphones and have a little bass.Overall it is a comfortable and stylish headphone with a affordable price. ❤❤READ MORE","It was good experience Bass can be improved, if u max out volume awaj bahar ajata h , for gaming its attractive and sound quality is good .. i use this headphone for PUBG and its worth it 😁😁😁😁😁READ MORE","I just love these headphones they are awesome for game lovers like me .The sound quality is very very nice .They are very comfortable and don't hurt or sweat my ears at all.It works just fine with a splitter.READ MORE","Very nice packaging . I love the design. Very soft cusion and good for long time use . Overall very nice 👍 👍👍 product 👍🎧🎧🎧must buy !!!!!!READ MORE","it was very nice powerful headphones. I ordered it on 29 October the date of delivery was given 7 November but it came on 4 November delivery was very fast .I LIKE IT    AWESOME😊READ MORE","best headset for gaming no background sounds clear mic no paining in ears after long time use.basically I use it for gaming.....and for watching movies best company cosmic byte I luv it....besteven I'm using mouse too..READ MORE","4 stars for it's late delivery..Product is amazing and superb. Best gaming headset in this price. If you love to play fps games like cod, cs go, battlefield... It's perfect for you..👍👍READ MORE","Good sound good mic. Depends on ur head. Will the headphones be comfortable.  Meant for a big heads earpadds size is big. Some might find it uncomfortable. Again it all depends on ur head size. That's the only con. Which depends on ur comfort level. Rest the headphones are very good. Only time will tell how long they last. Fingers crossed that it lasts Coz it's a gr8 deal. And the led lights make it look very cool.READ MORE","Nice and smooth audio qualityEspecially made for gamers!💥💥Amazing led feature, feels very soft to your ears!I am having a great experience.👍💥💥READ MORE","This is very good product. Mic is the specialty of this headphone. But as previous reviews ,sound quality is not so effective as I expected compared to price but it feels like a surround sound. Materials are very good. With the led lights it becomes more cool for live gaming on YouTube.READ MORE"],"Store":"f"},{"Srno":4,"Product_Name":"JBL Quantum 100 Wired Gaming Headset","Price":1399,"Description":"With Mic:YesConnector type: 3.5 mm","Url":"https:\/\/www.flipkart.com\/jbl-quantum-100-wired-gaming-headset\/p\/itm3c8ee53b044b7?pid=ACCFSKBYFZKMMHPH&lid=LSTACCFSKBYFZKMMHPHDHGSTJ&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_5&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCFSKBYFZKMMHPH.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/kflftzk0pkrrdj\/headphone-refurbished\/w\/x\/a\/a-quantum-100-jbl-original-imafw3z6ryqbsb6x.jpeg?q=70","Ratings":4.0,"Reviews":["It's gaming headphones, you should not be expecting really good highs or really good bass.Tbh bass is like minimal. But really good sound, nice fit on the head, really loud and the mic is amazing.So overall they're a really good pair of headphones, but if your intentions are for listening to music, then probably go for the JBL T460 or T500READ MORE","*Just go for it beet for meeting & work from home.*Come to bass it has decent bass good enough for music 😇*Looking great in blue colour * you can wear this all day long without  any painREAD MORE","Using for just one day.Pros: Rugged design, over the ear, flexible, detachable and sensitive mic near the mouth. Cancels almost all surrounding noise, comfortable head pad and good quality ear cushion. Tight fit.Cons: Very difficult to use during summer, perspiration starts around the ears, one might want to take a break while using to get some air. Cable is not very long and doesn't appear sturdy.READ MORE","I mainly play Warzone and these entry level headsets are excellent for it. Enemy footsteps are clear (just make sure audio settings are set to low boost). Mic is okay, not very audible but yeah I don't speak often while gaming. It comes with a 3.5mm jack and no splitter for PC.READ MORE","These are the best gaming headphones in the price range of 2000 - 4000 . I have been using these from last 3-4 months but did not get any problem . the mic works really good too . The bass is good and the sound quality is awesome . I use this with my PS3 and laptop . I will recommend buying these :)READ MORE","I have used this for 3 weeks now! The headphones are great for gaming. You can hear every footstep (even the slightest ones). They are a great gaming headsets no doubt about that! With that said they sound good while listening to music as well. They are not great music headphones or anything but being a JBL headphone they do sound really nice! Don't expect any boomy bass or anything but just sound is good and enjoyable! You will have a great time with this headphone!So that's all the good! B...READ MORE","The first thing you have to keep in mind that it’s meant for gaming and it’s the entry level good quality gaming headphone. I’m into lot of headphones and speakers. I have observed the quality of JBL - Harman products. Coming to the point. I’m using it on my PS4 and it’s working as expected. Sound level is not that much great as I have also used other headphones so level was same. Mic works fine and yes you can hear every sound very clear. I played COD - Cold War & Warzone for approx 14 hou...READ MORE","Pros: 1) Overear - can wear for long2) 3.5mm Jack3) mic is separable , can listen if not required to speak4) ear cups are smooth, even the head rest part is also smoothcons:1) No Nise cancellation2) mic is not good3) length of cable 1m around4) mic is on left side, so if your mic point is on right of lap then wire will cross your keyboard5) Design wise if you put your left cup to right then you can not use mic as mic would be towards back of the neckREAD MORE","Very good product. Decent bass and good loudness.Good thing is the cup fit covering full ears.White colour is attractive.Detachable mike is good add onREAD MORE","Really comfortable to wear. Audio quality is decent.READ MORE"],"Store":"f"},{"Srno":5,"Product_Name":"Wings Vader 300 Wired Gaming Headset","Price":799,"Description":"With Mic:YesConnector type: 3.5","Url":"https:\/\/www.flipkart.com\/wings-vader-300-wired-gaming-headset\/p\/itma7c2c1b5d1035?pid=ACCGBYTGHRBDKWQ8&lid=LSTACCGBYTGHRBDKWQ8HXUEWE&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_6&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCGBYTGHRBDKWQ8.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l0cr4i80\/headphone\/w\/v\/f\/-original-imagc5m6fhvw973f.jpeg?q=70","Ratings":4.2,"Reviews":["This headphones give me an awesoe experience while gaming with its unbelievably good sound.I have been using this for product regularly for long hours and it is simply amazing.I tried other local gaming headphones but non were good since they all gocused on bass insted of clarity , which is an exceptionally bad idea when playing any multiplayer game. The mic is also similarly very clearIts perfect gaming headphones under budget all in one package, quite comfortable for long hours highly ...READ MORE","I had been in the market for a good quality reasonably priced Wired Gaming headphones for around 2 months now and as soon I heard about the launch of this beautiful looking pair, I just couldn't resist ordering one for myself. I am so relieved because it was a great decision as the sound quality is fabulous (especially for the purpose of gaming). The availability of an adjustable headband is what attracted me most towards these headphones and it works flawlessly. They might feel a little on t...READ MORE","I used this wings Vader 300 headphones for 7 days and thyy are absolutely good and sound quality is also a class .. and also at a very good price .. loved it ..READ MORE","I have ordered this for gaming purpose .. but it's really a beast . Thanks to flipkart for one day delivery . It was awesome . I am playing valorant on this it's just a awesome because the vocals are crystal clear and bass is not that punch y. You can buy only for gaming not for music . So just go for it ...READ MORE","Awesome product..best gaming headphone..as to comfort they are awesome..the ear pads are soft and fairly plush, noise cancelling is decent, all in all, if you like extremely bass heavy headsets, you'll be ok with this.READ MORE","I am writing this review after 10 days experience: I really love this headphone and i think in this price range this is the best headphoneFirstly i gonna tell you what type of user i am:I want a headphone for daily 7-9 hours of useand the rader 300 gives me smooth ear cup and comfortable for wearing long hour Pros: comfortable for use(have smooth ear cup)          build is very good (it's look like primium                                           it's feel like primium             ...READ MORE","Good Quality headphone . sound of this headphone is fabulous . Light make this headphone attractive and wonderful which make this headphone awesome.READ MORE","Amazing sound. I can't say much bad about this. The sound is great, I use these playing my xbox one and the jack being connected to my controller. When wearing these the sound of footsteps when playing things like cod, and its very easy to determine where your enemy is . The cushion on the ears are nice and soft but also a nice easy to wipe material and compared to my old material ones that disintegrated, these are much better and will last. The head band is easily adjusted and stays in place...READ MORE","Very nice headphones I played freefire for 2 hours straight I didn't feel uncomfortable while playing.The cushions are very soft and comfortable The quality is very good at this price.If your thinking to buy this hurry before it's late.These are Hell good man!READ MORE","This is a premium quality product from wings. It's professional grade 40 mm drivers  with a professional fine finish.The ear cushion is good experience. The sound quality is fabulous and does not give a pain in the ear. It also is easy to carry around as it folds inwards, it also fold towards the sides which makes it extremely easy and safe to keep on a table. All over it is an awesome product.READ MORE"],"Store":"f"},{"Srno":6,"Product_Name":"Redgear Cosmo 7.1 RGB Wired Gaming Headset","Price":1299,"Description":"With Mic:YesConnector type: 3.5 mm","Url":"https:\/\/www.flipkart.com\/redgear-cosmo-7-1-rgb-wired-gaming-headset\/p\/itm3c6f5879a6ec8?pid=ACCF6N8A76AQQ7H6&lid=LSTACCF6N8A76AQQ7H6DJWDAN&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_7&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCF6N8A76AQQ7H6.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l30hmkw0\/headphone\/j\/y\/y\/-original-image8f8fas9htgz.jpeg?q=70","Ratings":4.3,"Reviews":["Best entry level gaming headset.As good as hyperx cloud stinger which costs around 4k....This headset is great for gaming but average for music and movies....I will update review if there is any problem.You can buy this headset without any second thought..... Absolutely worth the price.READ MORE","I used this headphone for like 2-3 months and I love using this headphone.—— SOME GOOD POINTS ——1. This headphone give you extra protection in wire ( WIRE CONTAINS BRIDED AND RUBBER RAPED ) ,2. All modes will be given you to your hand ,3. Sound quality is 100\/100 and base quality is also 100\/100 ,4. I played many game and I really observed that this headphone really contain 7.1 sound ,5. I also used them in music and I really prefer to use them in gaming and music.READ MORE","A bit on the heavier side, but very nice build quality and comfortable to wear. Very nice 7.1 surround sound for gaming. Highly recommend.READ MORE","Good ruggedness also a little heavier than usual ones drians your phone battery fast , no option to turn of button lights ,sound driver update not properly working ,I have used it for 1 month, so this is a one month review ,I will edit in futureREAD MORE","1.this is too big to be true it's not hevy2.this sound feels low but the vibration of bass I can feel it 3.it is gonna work with phone also but mostly with c port not with  a port one 4.rgb is to good and microphone RGB is to bright as far as I think  and controler RGB are same bright as  microphone 5.built quality decently feels like 5000 or 6000 rs  in rage of 1800 to 2000 you can get this 6.it fit to tight in the beginning but will lose after some use so no proble  thare 7.the wire i...READ MORE","Its too good and value for moneyI loved this best sound Doing all the works properly Buy it without any hesitationREAD MORE","Review after 4 day of use: definitely worth it. The sound quality is fantastic, and the best part is it's mic. Remember to download it's driver to get more fun of it's mic. Also the 3d effect with RGB light look so cool🔥.READ MORE","good bass, excellent quality, but having around 650gm which is not confortable even for 15-30min. Since its covering entire ears, warm around that area and i always feel like if it have  an air conditioner inside.READ MORE","All good i loved this hadeset!Its worth your money!Now lets highlight issues!!Its heavy abut sturdy build not for too long sections But earpads make it betterYou will not like to ware it in summer but i think that's the problem with all hadepohes!Sound is crisp and clear you can hear enemiesBut if you are noob this will not make you pro!READ MORE","Yes this works excellent this best headphone I have ever used , yes it works on Mobile and mic also works . SO ,You confused , yeah bro it is best for pubgmobile(BGMI) , keep audio settings of Pubg high for best experience or you may get irritated on Ultra sounds. When it is new you will feel like unbalanced sound as left side more sound , but it will automatically get fixed in 2days I did almost 1 month research before buying and currently it's about 2 weeks using this I am completely sati...READ MORE"],"Store":"f"},{"Srno":7,"Product_Name":"WeCool Freesolo x3 Bluetooth Gaming Earbuds Bluetooth H...","Price":699,"Description":"With Mic:YesBluetooth version: 5.1Wireless range: 10 mBattery life: 30 hrBattery life: 30 hrs | Charging time: 1.5 hrUltra low latency | Type-C Fast ChargingAuto pairing \/ Touch Controls \/ Voice Assistant \/ IPX5 Water Resistant","Url":"https:\/\/www.flipkart.com\/wecool-freesolo-x3-bluetooth-gaming-earbuds-headset\/p\/itm0a4d40fd04e54?pid=ACCGAGYYAGTSQ892&lid=LSTACCGAGYYAGTSQ892X38THO&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_8&otracker=search&iid=en_7j8iHdF3eEer7z3t%2Fy1Ck4tC%2BTXWda76mTGxecr9HDfCUttmvzNsweyc7MKSfvm6e8Dpxq%2Bshh8xlmSfrdE1sA%3D%3D&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/ky90scw0\/headphone\/o\/k\/a\/freesolo-x3-bluetooth-gaming-earbuds-with-60ms-low-latency-30-original-imagagyyqgqjze3g.jpeg?q=70","Ratings":4.0,"Reviews":["It's very cool and comfort gadget and it's baas is clear and sweet sound other earbuds it's good quality and design I am very happy to buy this product and it's very useful for you and me.READ MORE","1. Highly recommended 2. Sound quality is good 3. Gaming lights look awesome4. Latency in gaming mode is the lowest 5. Battery backup is awesome.Fabulous ... It's magical Pro It's was Great experience !!! A lot brand I used but here some unique Yea it's worth it... You can buy!!READ MORE","Product is very awesome 😊 very good sound quality battery backup is 👍 good comfortable 👌 hain bahut he Jayda I like it product..READ MORE","Ohhh woww this is absolutely Beauty I love it we cool thank you so muchREAD MORE","As usual quick delivery from Flipkart..Product is worth the price, decent bass and good back up.. loved it..READ MORE","Overall good product nice sound, fittings and weight less.. but when u use it with the biggest earbuds given with it.. It doesn't properly fit in the case. Case design doesn't let u fit the largest rubber buds given in stock.READ MORE","I dont like the this ear buds first think this sound quality are really very bad and disconnected several times auto mute the call battery backup was good but if i consider the price its too high for this quality bcoz its not upto mark im not satisfied bcoz its feel very cheap in photo u feel its a amazing but in reality the plastic material was to cheap not happy dont purchase this earbuds this is my honest reviewREAD MORE","Ya it's looking awesome sound is not bad but bass is also not badHow about gaming mode mean it's okay for this priceBattery backup is awesome Mic is amazingWecool is amazing i love this Bluetooth deviceREAD MORE","Best in this price range but it has a big issue mic doesn't work properly while we are on call it's sound quality is good but the issue is with mic Bass is top levelSound quality averageBuild quality is little bit on the lower side Rather than everything is ok in this price don't expect moreREAD MORE","My suggestion is please develop a app for this....i will also give my review after 1 year ❤️..According to the product I received it 25 July 2022 ,it's a simple outstanding and bass is awesome, sound is very very impressive.... I know ur waiting for gaming mode 😉 . Perfect for BGMI .. Trust me go blind for it and u feel that it is not 60ms , it is less than 50ms u feel that trust me for it... Finally it is a excellent excellent product in this price range.... I love it .... Last but not ...READ MORE"],"Store":"f"},{"Srno":8,"Product_Name":"Cosmic Byte GS410 Wired Gaming Headset","Price":399,"Description":"With Mic:YesConnector type: 3.5 mmFlatwire: Stays tangle free even in your pocketPerfect for playing games, listening to music, etcFlexible microphone, Smart in-line Remote Control for sound and micSingle 3.5mm Jack for sound and mic, Adjustable length hingesDelivers clear sound and deep bass for real game","Url":"https:\/\/www.flipkart.com\/cosmic-byte-gs410-wired-gaming-headset\/p\/itmbcd316eb562be?pid=ACCEW8BCXV6UWFXG&lid=LSTACCEW8BCXV6UWFXGUJSUUY&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_9&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCEW8BCXV6UWFXG.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/jz05rww0\/headphone\/m\/x\/e\/cosmic-byte-gs410-original-imaf8eyebusmqbt6.jpeg?q=70","Ratings":4.2,"Reviews":["Nice product from cosmic byte, for listening music its just okay not too high bass not too low, medium bass and crisp sound quality in high lows and mids,For gaming its very good you can surely go for it.And yes the mic quality is also nice crystal clear sound comes out in normal video call or voice call and even while playing games and voice chatting in game.still question remains. Is it worth money? answer is simple if u want for gaming you can't get better than this in this price range an...READ MORE","One of the best gaming headset under 1k fantastic audio profile and good level of comfort must buyREAD MORE","Super quality ..............100\/100                                                                                     I like this headset .                                                                                  I'm Gamer and it's really improved my Gameplay.                 Don't think 🤩 Buy Now...                                                            Great work #CBREAD MORE","don't think much just buy..worth of money ..sound  bass all is awesome I am very happy with this product. But little heavy and long wire.. quality is superbREAD MORE","the best budget Gaming headset awesome for PC gaming and even for mobile games while u play pubg u can clearly Know where the sound like footsteps and firing coming from it also got amazing bass quality perfect for music u r thinking to buy then buy it right nowREAD MORE","love This Headphone .i give it 9\/10. Sound quality is Best . Bass Quallity could Be Better. design Is So comfortable. i think In This Budget this Headphone for Gaming Is Best for Android and PC etc. Mic Is Access Smooth Voice . i think Best Headphone In this Budget.READ MORE","Just AWSOME! This is a beast... I really liked it because of the sound system and mic everything is actually AWSOME in this headphone I am a gamer and I always wanted an AWSOME cheap headphone and I finally found it....I will give it full star because best delivery service best product they said 10 days but with in 3 days I got the product ~PEEAREAD MORE","Nice product. Bass quality is very good. & It's good for GAMES like PUBG, FREE FIRE etc.READ MORE","comfortable headphones with great quality material they will cover your ears properly so that you won't feel any pressure on your ears mic on off button also available, proper padding done on the headphones must buy in this rangeREAD MORE","\"very good product in budget price range.........for gaming it's moster.....this mic works superb....this is really good headset I will recommend \"READ MORE"],"Store":"f"},{"Srno":9,"Product_Name":"Cosmic Byte Stardust Wired Gaming Headset","Price":399,"Description":"With Mic:YesConnector type: 3.5mm","Url":"https:\/\/www.flipkart.com\/cosmic-byte-stardust-wired-gaming-headset\/p\/itmd0cacb2fbe695?pid=ACCFVYEFASDHJ5JS&lid=LSTACCFVYEFASDHJ5JSM3VZID&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_10&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCFVYEFASDHJ5JS.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/keaaavk0-0\/headphone\/d\/p\/f\/stardust-cosmic-byte-original-imafvy34hgj55j6f.jpeg?q=70","Ratings":4.2,"Reviews":["Very good product comfortable to keep on ears and everyone can use it(of all ages) the sound is very perfect , the Mike is flexible must buy the product ❤READ MORE","Very good product comfortable to keep on ears and everyone can use it of all ages the sound is very perfect and the Mike is flexible must by the productREAD MORE","Its very good for gaming and music both...but its a bit heavy which makes it uncomfortable to wear while lying😂 really....and its earcups have a good fit so it warms up the ear...and so u can't do gaming for 4-5 hours....but if u get used to it its fine... talking about overall review its really good...if u are thinking to buy it at a range like this u won't get any better option! Thank you!READ MORE","This is excellent and definitely this price range is absolutely fine for this product and bass is better for gameplay and music is too good. So you can trust and buy at this price range, Very Nice Headphone.READ MORE","This is an amazing product, I've been using this for a while. It's physically hard and if you are planning to buy for PUBG then it's the best earphone in this price range. Footsteps are very clear and I compared with my other headsets but this one is performing interesting well. But bass is not so good and in most of the gaming headsets we actually don't get that. If you are thinking to use this outdoors then it will be a problem because its heavy and quality will be not be upto the mark. Thi...READ MORE","Very nice headphone Nice bassVery nice sound Design is like very awesome In short you should buy thisREAD MORE","Ya so Headphones are good on this price but on pubg the foot steps issue is there the foot steps are little messi I think it's problem of my device other wise it's good quality the mic is very good and it's comfortable for ears the spong is leader because of leader after sometime ur ears will get pain better u change that spong other wise ahhhhh it's good ❤️READ MORE","This product is one of the best I love this product this is very amazing this mike is very OP I love thisREAD MORE","Very nice headphones I played freefire for 2 hours straight I didn't feel uncomfortable while playing.The cushions are very soft and comfortable The quality is very good at this price.If your thinking to buy this hurry before it's late.These are Hell good man!READ MORE","Super quality product,sound and bass is too good and build quality and disign is awesome then packing quality and fast delivery within 2days , overall lit 🔥READ MORE"],"Store":"f"},{"Srno":10,"Product_Name":"Wings Phantom 250 Gaming TWS Earbuds with 40ms Low Late...","Price":599,"Description":"With Mic:YesBluetooth version: 5.2Wireless range: 15 mBattery life: 30 hr | Charging time: 1.5 hrs","Url":"https:\/\/www.flipkart.com\/wings-phantom-250-gaming-tws-earbuds-40ms-low-latency-30-hours-playtime-bluetooth-headset\/p\/itm8f261ce7a68a3?pid=ACCGDQ6SJJV63U4H&lid=LSTACCGDQ6SJJV63U4HRWG7WU&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_11&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCGDQ6SJJV63U4H.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l51d30w0\/headphone\/4\/q\/a\/-original-imagfsskkkk8au5q.jpeg?q=70","Ratings":4.0,"Reviews":["Box looking evel sexy but buds looking quality avrg.. blue color variant looks like apricot colour.. better go for black.. sound & bass excellent,  i don't know abou gaming. Single bud or double can be used , mostly comfortable ear fitting.. only con is buds looking like cheap.READ MORE","The best gaming and Normal airport on this price segment. I love the sound and sound quality every one love it 🙂❤️READ MORE","Best earbuds at very affordable price. Best gaming buds with nice quality sound and bass. Unique design look wise very very nice. Charging case looks great due to lighting effect.READ MORE","Best product you can buy in this range . Sound quality is good and connecting speed is really fast and battery backup is also good . You will get perfect sound by playing music on this players . Fully satisfied with my purchase .READ MORE","Best product you can buy in this price range . Sound quality is very good and bass is awesome connecting speed is really fast and battery backup is also good and best part is that it is also good for gaming . You will get perfect sound and latency by playing game and also music on this players . Fully satisfied with This purchase .READ MORE","Vocals are good for the price with balanced bass and treble. Gaming mode is very good which feels like no latency at all . Overall a good product for the price and build quality is also good.READ MORE","I am giving this a 3* because it has some cons that I didn't like that much....Advantages.....1.Sound is ok,2.Delay is ok.... For a 700 rupee earbud.....3.Loudness is good4.Fitting good5.Battery backup is good....6.Touch is goodDisadvantages.....1. If you don't pull out the earbuds on a right way... The left earbud will not connect..... 2. Sometime the volume goes down to zero automatically.....3. The range is bad.... Conclusion.....If you get this on price of 700 its value for...READ MORE","Lovely product looks like a bat eye....Sound quality nice, sweet and melody sound..Design by and quality by love it.READ MORE","Got it for only 899 from Flipkart. But I have to say, it's really impressive, the auto-pairing is spot on, the sound quality is brilliant, the battery is massive too so that's a plus point as well. Design is also premium. Really very happy for this led  premium looks. Packaging was good. Delivered before estimate time. Reasonable price.READ MORE","Amazing Product sound quality is very nice design & shape is superb best for gaming no ear pain really very nice productREAD MORE"],"Store":"f"},{"Srno":11,"Product_Name":"Redgear Cosmo 7.1 RGB Wired Gaming Headset","Price":1299,"Description":"With Mic:YesConnector type: 3.57.1 Surround SoundHigh Quality Noise Cancelling MicWiredRGB LightingEasy Volume ControlComfortable FitAdjustable HeadbandDurableStrong BuildLight Weight","Url":"https:\/\/www.flipkart.com\/redgear-cosmo-7-1-rgb-wired-gaming-headset\/p\/itma73adbe00cb9c?pid=ACCG2DGWH2GSMWZC&lid=LSTACCG2DGWH2GSMWZCLKPGUX&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_12&otracker=search&iid=en_7j8iHdF3eEer7z3t%2Fy1Ck4tC%2BTXWda76mTGxecr9HDfeeseuI5MiCumzKsxm34yFsqqkuyTY3CLVTw1C4WgeuQ%3D%3D&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l30hmkw0\/headphone\/h\/z\/g\/-original-image8f8txrxf9gn.jpeg?q=70","Ratings":4.3,"Reviews":["Best gaming Headphone with best mic Under 2k . This Headphone Is very Good for Play PUBG because The Footsteps is very clear 🤩🥰💯READ MORE","This headphone comes with high quality sound and build quality with low budget gaming headphone category.If you want to buy this it is good choose.READ MORE","Nice product 😀😀READ MORE","Best under 2000 for gamingREAD MORE","Looks big and heavy but not exactly, it's very comfortable and light. It has very good sound. The lights are so damn good. And the switch mechanism is absolutely wonderful. MUST BUY.READ MORE","Superb..READ MORE","I love it ,Overall gameing experience next levelREAD MORE","Very very good product 🙂READ MORE","In this Price Rnage I ahve never expected,I used to buy this to improve my Laptop’s Audio Recording.READ MORE","NiceREAD MORE"],"Store":"f"},{"Srno":12,"Product_Name":"Wings Phantom Gaming TWS with 50ms Low Latency Bluetoot...","Price":799,"Description":"With Mic:YesBluetooth version: 5.3Wireless range: 10 mBattery life: 30 Hours | Charging time: 2 hrs","Url":"https:\/\/www.flipkart.com\/wings-phantom-gaming-tws-50ms-low-latency-bluetooth-5-3-headset\/p\/itm35312d3099ce5?pid=ACCGF8EWXCCWXWJZ&lid=LSTACCGF8EWXCCWXWJZ3T0T5Q&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&spotlightTagId=BestsellerId_0pm%2Ffcn&srno=s_1_13&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCGF8EWXCCWXWJZ.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l44hyfk0\/headphone\/7\/p\/v\/-original-imagf362ucca9yrz.jpeg?q=70","Ratings":4.0,"Reviews":["ABSOLUTELY LOVE THESE TWS HEADPHONES, ONLY BOUGHT THEM FOR GAMING BUT I FIND MYSELF USING THEM ALL THE TIME NOW, TO WORK, TO THE GYM, WHILE STUDYING. SO EASY TO FUNCTION WHICH IS ALWAYS A PLUS, COMES WITH VERY SMART, COMPACT AND RECHARGEABLE CASE SO YOU DON’T NEED TO WORRY ABOUT REACHING INTO YOUR BAG TO FIND THEM, OR DEAL WITH UNTANGLING ANY WIRES! QUALITY IS EXTREMELY GOOD DID NOT EXPECT THE SOUND TO BE SO CRYSTAL CLEAR WITH THE PRICE.THE MAIN PART OF THE PRODUCT IS ITS LATENCY WHICH GIVES ...READ MORE","Nice product sound quality is good and bass is also decent and the buils quality is amazing and attractiveREAD MORE","ONE OF THE BEST OUTSTANDING PRODUCT WITH SUPERB SOUND QUALITY..Noise cancellation is at best level as well as the attractive design and material..Best product ever at this price.. Value for money ❤️❤️READ MORE","At past I was using JBL-T 110 for continuously 4+ years (purchased 2 tyms)...u guys know JBL sound n build quality, it's literally awsome but due to it's jack problem now I had to move forcefully n go with wings phantom earbuds. Dear gamers just go for it....every single footsteps sound will be clear n loud (but not as I receives in my JBL earphone). N it's last pros...latency the main reason to buy it. Haa but if u r a pure heartily music lover u can proceed further but as a gamer go for Bo...READ MORE","Looks wise its a beast...snake eye ...its had a bright green light if we change colour then it's look more attractive but there is no option to change colour after all sounds good ....trible alignment or bass is mission...😞 But i recommended to go with this product 😎READ MORE","Beast on gaming mode... Bass is decently good there is no over treble distortion.. Full touch controls is a nice flexible feature.. the Design of buds and case is awesome . Definitely the best build quality for the price they are offering. Value for money.READ MORE","Trebles are managed here, vocals- lows-mids-highs everything is very good. Thing that I like about it is the lights. For gaming it's good compared to other earbuds, I found low latency 65ms (as mentioned & by my experience of this product) but if you are buying it for pro-gaming purpose then I won't suggest this product. You should go for wired earphones or headsets. One thing for which I am disappointed is Light ON\/OFF option, If the brand would have provided it then it would be a better pro...READ MORE","Everything was mind blowing but the battery backup was very bad it is mentioned it will work for 20 hours but it's not working properly in just 4 hours battery become 30% even i replaced the product but the problem is still the same base and sound quality are just super cool only prob is in battery life and the case also gets discharged in just 1and half day which is not good so please try to improve the battery life and change the battery mentioned in details to 5 hours because it's not able...READ MORE","Must order this product if you love to play games like COD, PUBG , etc.. And this product is having special GAMInG Mode which enhances a gamer to have better experience.. 😊READ MORE","It's like expectations full filled 😍😍I just loved it and especially those who are pubg lovers and wanna play via Bluetooth this is one the best I've across so overall its a perfect match for gamingREAD MORE"],"Store":"f"},{"Srno":13,"Product_Name":"Wings Phantom 250 Gaming TWS Earbuds with 40ms Low Late...","Price":599,"Description":"With Mic:YesBluetooth version: 5.2Wireless range: 15 mBattery life: 30 hr | Charging time: 1.5 hrs","Url":"https:\/\/www.flipkart.com\/wings-phantom-250-gaming-tws-earbuds-40ms-low-latency-30-hours-playtime-bluetooth-headset\/p\/itm2424b8c91c9e8?pid=ACCGDQ6SBHCVHMCG&lid=LSTACCGDQ6SBHCVHMCGCQRUQ1&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_14&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCGDQ6SBHCVHMCG.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l51d30w0\/headphone\/e\/0\/y\/-original-imagfsskqcbr2wzh.jpeg?q=70","Ratings":4.0,"Reviews":["Box looking evel sexy but buds looking quality avrg.. blue color variant looks like apricot colour.. better go for black.. sound & bass excellent,  i don't know abou gaming. Single bud or double can be used , mostly comfortable ear fitting.. only con is buds looking like cheap.READ MORE","The best gaming and Normal airport on this price segment. I love the sound and sound quality every one love it 🙂❤️READ MORE","Best earbuds at very affordable price. Best gaming buds with nice quality sound and bass. Unique design look wise very very nice. Charging case looks great due to lighting effect.READ MORE","Best product you can buy in this range . Sound quality is good and connecting speed is really fast and battery backup is also good . You will get perfect sound by playing music on this players . Fully satisfied with my purchase .READ MORE","Best product you can buy in this price range . Sound quality is very good and bass is awesome connecting speed is really fast and battery backup is also good and best part is that it is also good for gaming . You will get perfect sound and latency by playing game and also music on this players . Fully satisfied with This purchase .READ MORE","Vocals are good for the price with balanced bass and treble. Gaming mode is very good which feels like no latency at all . Overall a good product for the price and build quality is also good.READ MORE","I am giving this a 3* because it has some cons that I didn't like that much....Advantages.....1.Sound is ok,2.Delay is ok.... For a 700 rupee earbud.....3.Loudness is good4.Fitting good5.Battery backup is good....6.Touch is goodDisadvantages.....1. If you don't pull out the earbuds on a right way... The left earbud will not connect..... 2. Sometime the volume goes down to zero automatically.....3. The range is bad.... Conclusion.....If you get this on price of 700 its value for...READ MORE","Lovely product looks like a bat eye....Sound quality nice, sweet and melody sound..Design by and quality by love it.READ MORE","Got it for only 899 from Flipkart. But I have to say, it's really impressive, the auto-pairing is spot on, the sound quality is brilliant, the battery is massive too so that's a plus point as well. Design is also premium. Really very happy for this led  premium looks. Packaging was good. Delivered before estimate time. Reasonable price.READ MORE","Amazing Product sound quality is very nice design & shape is superb best for gaming no ear pain really very nice productREAD MORE"],"Store":"f"},{"Srno":14,"Product_Name":"Wings Phantom Pro Gaming TWS with 40 Hrs Playtime,50ms ...","Price":899,"Description":"With Mic:YesBluetooth version: 5.3Wireless range: 10 mBattery life: 30 hrs | Charging time: 1 hrs","Url":"https:\/\/www.flipkart.com\/wings-phantom-pro-gaming-tws-40-hrs-playtime-50ms-low-latency-bluetooth-5-3-headset\/p\/itm9ceff01aba2bd?pid=ACCG4XTZKH5GFPVD&lid=LSTACCG4XTZKH5GFPVDIWEWLF&marketplace=FLIPKART&q=Gaming+Headphone&store=0pm%2Ffcn&srno=s_1_15&otracker=search&iid=aec59b78-44fc-4491-a308-4632cf8ef660.ACCG4XTZKH5GFPVD.SEARCH&ssid=dotg80ef4w0000001664523557797&qH=5d6c063df8e6e654","Image_URL":"https:\/\/rukminim1.flixcart.com\/image\/612\/612\/l44hyfk0\/headphone\/3\/c\/m\/-original-imagf363pdhr4sgh.jpeg?q=70","Ratings":3.9,"Reviews":["Pros - 1. Highly recommended Budget Gaming TWS.2. Sound quality is good in this price range.3. Gaming lights look awesome 4. Latency in gaming mode is the lowest.5. Battery backup is awesome. Cons - 1. Difficulty in opening the case can be seen. 2. While playing PUBG difficulty in understanding the footsteps direction. 3. Starts paining on the left ear, don't know if it's only for me. Overall a good budget gaming TWS in this range.READ MORE","Honestly, one of the best product available in the market for gaming with 60 mili seconds of lag which is not available in the market right now and the sound quality is superb. Best buy for gaming 🎮READ MORE","Fabulous ... It's magical ProIt's was Great experience !!! A lot brand I used but here some unique base band!!! Yea it's worth it... You can buy!!READ MORE","Every thing is good. Good sound, good bass. But I am dis satisfied by built quality. Within 2 months the case broke open into 2 parts. I had to attach them by glue. But except that it's ok. I don't play much games, so don't know about latency. But no visible latency while watching movies. So please improve the build quality.READ MORE","What a Monster this product is. Loved it. Stylish looks and extremely good gaming experience. I had Phantom before this and the Phantom Pro is definitely a very good upgrade.READ MORE","Good Sound quality. Great build quality. Best TWS at affordable price.READ MORE","One of the best purchase of my life Build quality is super, i droped it like 5-6 times and it still works perfectly.READ MORE","This is my 1 st day with wings phantom pro previously i was using noise earbuds which are good in case of build quailty and loud ness but this beast is next level ,  very important point is eventhough u are in music mode and play pubg it will be like a littile delay but we cannot identifiy but while switching to game mode it performs like beast every thing is great touch sensitivity is also so great so quick responce go for it is best value for money for both gaming and daily life activities ...READ MORE","Only meant for devices which supports high quality audio.I have poco F1 and recently purchased oneplus nord 2 5g.On poco F1 these sounded horrible with too much overpowering bass but on oneplus sounds pretty good after selecting higher audio quality from bluetooth menu.Looks good feels good but isn't upto the job it boasts of i.e low latency gaming.There is noticeable audio lag in intense moment you won't be able to figure out with the audio.For example in bgmi you won't be able to locat...READ MORE","If you like LED then this product is best. Best for listening music in normal mode and can hear the footsteps easily in gaming mode and the bass reduced during that mode.READ MORE"],"Store":"f"}]